#ifndef _VACUUM_WATCH_CONSTANTS_H_
#define _VACUUM_WATCH_CONSTANTS_H_

//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 整个程序范围的宏定义                                                  */
/************************************************************************/
#define VW_WINDOW_TITLE ("Vacuum-Watch")
#define VW_WINDOW_WIDTH (800)
#define VW_WINDOW_HEIGHT (600)
#define VW_REFRESH_INTERVAL (40)	//ms


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 在option里的默认设置，即没有之前文件可读的时候的返回的参数               */
/************************************************************************/
#define VW_OPTION_DEF_BGM (true)		//背景音乐开启？
#define VW_OPTION_DEF_EFFECT (true)		//音效开启？
#define VW_OPTION_DEF_VOLUME (50)		//默认音量百分比，50%
#define VW_OPTION_DEF_FIRE_KEY (' ')	//默认fire的键位，默认采用' '，空格(32)


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 游戏数据 Game Data 初始默认值、相关数值                                */
/************************************************************************/
//////////////////////////////////////////////////////////////////////////
#define VW_DATA_DEF_STAGE (1)	//默认初始关卡
#define VW_DATA_MAX_STAGE (5)	//默认最大关卡，]而不是)
#define VW_DATA_DEF_SCORE (0)	//默认初始分数


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 游戏程序的逻辑状态                                                    */
/************************************************************************/
//////////////////////////////////////////////////////////////////////////
#define VW_STATE_MENU (0)		//刚进游戏，菜单的地方
#define VW_STATE_SETTING (1)	//在菜单，选择设置之后
#define VW_STATE_ABOUT (2)		//在菜单，选择关于之后
#define VW_STATE_ONGOING (3)	//游戏进行中
#define VW_STATE_PAUSED (4)		//游戏暂停了


#endif
