#ifndef _VACUUM_WATCH_CONSTANTS_H_
#define _VACUUM_WATCH_CONSTANTS_H_

//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 整个程序范围的宏定义                                                  */
/************************************************************************/
#define VW_WINDOW_TITLE ("Vacuum-Watch")
#define VW_WINDOW_WIDTH (800)
#define VW_WINDOW_HEIGHT (600)
#define VW_REFRESH_INTERVAL (40)	//ms
#define VW_PI (3.1415926535898f)


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 在option里的默认设置，即没有之前文件可读的时候的返回的参数               */
/************************************************************************/
#define VW_OPTION_DEF_BGM (true)		//背景音乐开启？
#define VW_OPTION_DEF_EFFECT (true)		//音效开启？
#define VW_OPTION_DEF_VOLUME (50)		//默认音量百分比，50%
#define VW_OPTION_DEF_FIRE_KEY (' ')	//默认fire的键位，默认采用' '，空格(32)


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 游戏数据 Game Data 初始默认值、相关数值                                */
/************************************************************************/
//////////////////////////////////////////////////////////////////////////
#define VW_DEF_STAGE (1)				//默认初始关卡
#define VW_MAX_STAGE (5)				//默认最大关卡，]而不是)
#define VW_DEF_SCORE (0)				//默认初始分数
#define VW_DEF_TUNNEL_RADIUS (50)		//默认隧道半径
#define VW_DEF_TUNNEL_LENGTH (10000)	//默认隧道长度
#define VW_DEF_TUNNEL_STEP (1)			//默认在隧道中每次走多少
#define VW_DEF_MOVE_SPEED (5)			//默认的飞机通过上下左右方向键进行位置变换的速度
#define VW_DEF_WALL_DISTANCE (200)		//默认每这么长的距离就有一个遮挡板
#define VW_DEF_VELOCITY_ONE (5)			//默认第1级别的地图速度
#define VW_DEF_VELOCITY_TWO (10)		//默认第2级别的地图速度
#define VW_DEF_VELOCITY_THREE (15)		//默认第3级别的地图速度
#define VW_DEF_VELOCITY_FOUR (20)		//默认第4级别的地图速度

//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 隧道中的遮挡板wall的类型                                              */
/************************************************************************/
//////////////////////////////////////////////////////////////////////////
#define VW_WALL_NONE (-1)	//没有板子了
#define VW_WALL_ONE (0)		//类型1：中间镂空一个圆
#define VW_WALL_TWO (1)		//类型2：中间镂空一个正方形
#define VW_WALL_COUNT (2)	//一共有几种类型


//////////////////////////////////////////////////////////////////////////
/************************************************************************/
/* 游戏程序的逻辑状态                                                    */
/************************************************************************/
//////////////////////////////////////////////////////////////////////////
#define VW_STATE_MENU (0)		//刚进游戏，菜单的地方
#define VW_STATE_SETTING (1)	//在菜单，选择设置之后
#define VW_STATE_ABOUT (2)		//在菜单，选择关于之后
#define VW_STATE_ONGOING (3)	//游戏进行中
#define VW_STATE_PAUSED (4)		//游戏暂停了


#endif
